# Basic details
## Internshala -Fragma Data Systems | Business Analyst SQL - Solution
##### Name     : Bimal Kumar
#####  Email Id : bimal.kumar.mrb@gmail.com
#####  Mob No   : +91-9006212962
#####  Linkedin : [bimal-kumar](https://www.linkedin.com/in/bimal-kumar-5a6b8a157/)

In [21]:
import pandas as pd
import pandasql as psql
from pandasql import sqldf

In [22]:
data_dict = {
    "mesg_trn_no":['TF1005','TF1006','TF1005','TF1005','TF1006'],
    "Mesg_type":[700,710,710,707,707],
    "Field_code": [50,59,59,50,59],
    "Field_value": ['CVC','PVC','Mahindra','Mahindra','AVON'],
    "mesg_crea_date_time": ['10/10/2020','1/09/2020','12/10/2020','12/11/2020','17/11/2020']
}

In [23]:
df = pd.DataFrame(data_dict)

In [24]:
df['mesg_crea_date_time'] = pd.to_datetime(df['mesg_crea_date_time'])

In [25]:
df

  mesg_trn_no  Mesg_type  Field_code Field_value mesg_crea_date_time
0      TF1005        700          50         CVC          2020-10-10
1      TF1006        710          59         PVC          2020-01-09
2      TF1005        710          59    Mahindra          2020-12-10
3      TF1005        707          50    Mahindra          2020-12-11
4      TF1006        707          59        AVON          2020-11-17

# SQL Query
### Find the latest Field_value of Field_code for each mesg_trn_no.

In [26]:
pysqldf = lambda q: sqldf(q, globals())

In [27]:
query1= """
        SELECT *
        FROM(SELECT mesg_trn_no,Field_code, Field_value,mesg_crea_date_time
            FROM df
            ORDER BY mesg_crea_date_time DESC)
        GROUP BY mesg_trn_no 
        """

In [28]:
print(pysqldf(query1))

  mesg_trn_no  Field_code Field_value         mesg_crea_date_time
0      TF1005          50    Mahindra  2020-12-11 00:00:00.000000
1      TF1006          59        AVON  2020-11-17 00:00:00.000000

In [29]:
data_dict1 = {
    'ID':[1002,1003,1004,1005],
    'queuename': ['Maker','Checker','Exception','Exception'],
    'entrydate': ['1/10/2020','2/10/2020','17/11/2020','15/11/2020']
}

In [30]:
case_details = pd.DataFrame(data_dict1)

In [31]:
data_dict2 = {
    'ID':['1005','1004','1004','1005'],
    'queuename':['Exception','Exception','Exception','Exception'],
    'exception_comment':['ID card missed','signature mismatch','ID missed','Signature mismatch'],
    'actiondate':['4/09/2020','1/09/2020','17/11/2020','15/11/2020'] 
}

In [32]:
exceptionview = pd.DataFrame(data_dict2)

In [33]:
case_details['entrydate'] = pd.to_datetime(case_details['entrydate'])

In [34]:
exceptionview['actiondate'] = pd.to_datetime(exceptionview['actiondate'])

In [35]:
exceptionview

     ID  queuename   exception_comment actiondate
0  1005  Exception      ID card missed 2020-04-09
1  1004  Exception  signature mismatch 2020-01-09
2  1004  Exception           ID missed 2020-11-17
3  1005  Exception  Signature mismatch 2020-11-15

In [36]:
case_details

     ID  queuename  entrydate
0  1002      Maker 2020-01-10
1  1003    Checker 2020-02-10
2  1004  Exception 2020-11-17
3  1005  Exception 2020-11-15

# SQL Query
     Find the exact exception_comment for the ids in "Exception" queuename of case_details table.
     The final output must contain all the columns from case_details
     Fill the "exception_comment" with "NA" where not available.

In [37]:
query2 = """
        SELECT ID,queuename,COALESCE(exception_comment,'NA') AS exception_comment ,entrydate
        
        FROM (SELECT *
        FROM case_details
        LEFT JOIN exceptionview ON case_details.entrydate= exceptionview.actiondate
        ORDER BY case_details.ID DESC) AS join_table
        """

In [38]:
pysqldf(query2)

     ID  queuename   exception_comment                   entrydate
0  1005  Exception  Signature mismatch  2020-11-15 00:00:00.000000
1  1004  Exception           ID missed  2020-11-17 00:00:00.000000
2  1003    Checker                  NA  2020-02-10 00:00:00.000000
3  1002      Maker                  NA  2020-01-10 00:00:00.000000

In [39]:
data_dict3 = {
    'cif_no':['068974561','067897945','052345689'],
    'Debit_card':['123456768989','560889767867','454578982324']
}

In [40]:
MyTable = pd.DataFrame(data_dict3)
#MyTable['Ac_No'] = MyTable['Debit_card'].apply(lambda x:x[:4]+'XXXX'+ x[-4:])

In [48]:
query3= """
    SELECT Substr(Debit_card,1,4)||'XXXX' ||Substr(Debit_card,-4) as debit_card_No
    FROM MyTable
   """

In [49]:
pysqldf(query3)

  debit_card_No
0  1234XXXX8989
1  5608XXXX7867
2  4545XXXX2324

## Pure SQL query

In [43]:
import sqlite3

In [44]:
%%cmd
sqlite3 Fragma_Data.db

Microsoft Windows [Version 10.0.19042.804]
(c) 2020 Microsoft Corporation. All rights reserved.

(intelPython) G:\Python and SQL>sqlite3 Fragma_Data.db

(intelPython) G:\Python and SQL>

# Create a Table

    FD=sqlite3.connect('Fragma_Data.db')
    cur=FD.cursor()
    cur.execute('''CREATE TABLE MyTable(
    ID INTEGER PRIMARY KEY AUTOINCREMENT,
    cif_no varchar      (20) NOT NULL,
    Debit_card varchar(16));''')
    FD.commit()
    FD.close()

    Fragma_database=sqlite3.connect('Fragma_Data.db')
    cur=Fragma_database.cursor()
    cur.execute("INSERT INTO  MyTable (ID, cif_no,Debit_card) VALUES (101, '068974561','123456768989');")
    cur.execute("INSERT INTO  MyTable (ID, cif_no,Debit_card) VALUES (201, '067897945', '560889767867');")
    cur.execute("INSERT INTO  MyTable (ID, cif_no,Debit_card) VALUES (301, '052345689', '454578982324');")
    Fragma_database.commit()
    Fragma_database.close()

In [45]:
Fragma_database=sqlite3.connect('Fragma_Data.db')

# Given table have debit card numbers.WAQ to mask the debit card numbers:

In [50]:
sql= """
    SELECT Substr(Debit_card,1,4)||'XXXX' ||Substr(Debit_card,-4) as debit_card_No
    FROM MyTable
    """

In [52]:
cur=Fragma_database.cursor()
cur.execute(sql)
results = cur.fetchone() 
for record in results:  
    print(record)

1234XXXX8989

In [53]:
cur=Fragma_database.cursor()
cur.execute(sql)
results = cur.fetchall() 
for record in results:  
    print(record)

('1234XXXX8989',)
('5608XXXX7867',)
('4545XXXX2324',)

In [63]:
Fragma_database.close()